davidanson.vscode-markdownlint
dsznajder.es7-react-js-snippets
esbenp.prettier-vscode
formulahendry.code-runner
github.copilot
github.copilot-chat
github.github-vscode-theme
github.vscode-pull-request-github
ms-vscode.vscode-typescript-next
oracle.oracle-java
pkief.material-icon-theme
redhat.fabric8-analytics
redhat.java
redhat.vscode-community-server-connector
redhat.vscode-rsp-ui
redhat.vscode-xml
redhat.vscode-yaml
ritwickdey.liveserver
visualstudioexptteam.intellicode-api-usage-examples
visualstudioexptteam.vscodeintellicode
vmware.vscode-boot-dev-pack
vmware.vscode-spring-boot
vscjava.vscode-gradle
vscjava.vscode-java-debug
vscjava.vscode-java-dependency
vscjava.vscode-java-pack
vscjava.vscode-java-test
vscjava.vscode-maven
vscjava.vscode-spring-boot-dashboard
vscjava.vscode-spring-initializr
